; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	thermograph3 - mode
	image1 - mode
	infrared5 - mode
	image6 - mode
	infrared2 - mode
	thermograph0 - mode
	spectrograph4 - mode
	GroundStation0 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	Star8 - direction
	Star7 - direction
	Star1 - direction
	Star12 - direction
	Star11 - direction
	Star9 - direction
	Star10 - direction
	Star3 - direction
	Star5 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(supports instrument0 infrared5)
	(supports instrument0 infrared2)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 Star9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument1 image6)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star12)
	(supports instrument2 infrared5)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star10)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet13)
)
(:goal (and
	(pointing satellite1 Star12)
	(have_image Planet13 image6)
	(have_image Star14 image6)
	(have_image Star15 image1)
	(have_image Planet16 infrared5)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (turn_to satellite1 star12 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star12)
   goals met: 1 of 5
4. (calibrate satellite1 instrument1 star12)
   added: (calibrated instrument1)
   goals met: 1 of 5
5. (turn_to satellite0 planet16 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet16)
   goals met: 1 of 5
6. (turn_to satellite1 planet13 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 planet13)
   goals met: 0 of 5
7. (take_image satellite1 planet13 instrument1 image6)
   added: (have_image planet13 image6)
   goals met: 1 of 5
8. (turn_to satellite1 star12 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star12)
   goals met: 2 of 5
9. (turn_to satellite1 star14 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star14)
   goals met: 1 of 5
10. (take_image satellite1 star14 instrument1 image6)
   added: (have_image star14 image6)
   goals met: 2 of 5
11. (turn_to satellite1 star12 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star12)
   goals met: 3 of 5
12. (turn_to satellite0 star9 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star9)
   goals met: 3 of 5
13. (calibrate satellite0 instrument0 star9)
   added: (calibrated instrument0)
   goals met: 3 of 5
14. (turn_to satellite0 planet16 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet16)
   goals met: 3 of 5
15. (take_image satellite0 planet16 instrument0 infrared5)
   added: (have_image planet16 infrared5)
   goals met: 4 of 5
16. (turn_to satellite0 star15 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star15)
   goals met: 4 of 5
17. (take_image satellite0 star15 instrument0 image1)
   added: (have_image star15 image1)
   goals met: 5 of 5
